# Uso de Dataframe en Pandas
# Luisa Bermeo
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [3]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
#from pandas.tools.plotting import radviz

%matplotlib inline

In [5]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23], 'c': [24,25,26]}))
print (mi_df)

    a   b   c
0  11  21  24
1  12  22  25
2  13  23  26

In [8]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1],
       'numeroCantones': [34, 34, 56]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona  numeroCantones
0       Loja       Loja     7              34
1  Pichincha      Quito     8              34
2     Guayas  Guayaquil     1              56

In [9]:
columnas = ['nombres','apellidos','cedula', 'ciudad']

In [10]:
lista = [['rene', 'elizalde', '11041260', 'Loja'],
        ['rolando', 'solano', '11041261', 'Quito'],
        ['luisa', 'bermeo', '12212345', 'Cuenca'],
        ['josé', 'cuenca','12435431', 'Cañar'],
        ['pedro', 'carrion', '11256431', 'Guayaquil']]

In [11]:
data = pd.DataFrame(lista, columns=columnas)

In [12]:
data

   nombres apellidos    cedula     ciudad
0     rene  elizalde  11041260       Loja
1  rolando    solano  11041261      Quito
2    luisa    bermeo  12212345     Cuenca
3     josé    cuenca  12435431      Cañar
4    pedro   carrion  11256431  Guayaquil

In [15]:
lista2 = [['rene2', 'elizalde2', '11041263', 'Quito'],
        ['rolando2', 'solano2', '11041264', 'Loja'],]

In [16]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [17]:
data2

    nombres  apellidos    cedula ciudad
0     rene2  elizalde2  11041263  Quito
1  rolando2    solano2  11041264   Loja

In [18]:
data3 = pd.concat([data, data2])

In [19]:
data3

    nombres  apellidos    cedula     ciudad
0      rene   elizalde  11041260       Loja
1   rolando     solano  11041261      Quito
2     luisa     bermeo  12212345     Cuenca
3      josé     cuenca  12435431      Cañar
4     pedro    carrion  11256431  Guayaquil
0     rene2  elizalde2  11041263      Quito
1  rolando2    solano2  11041264       Loja

In [24]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266', '12212345', '12435431'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja', 'Cuenca', 'Cañar'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja', 'Azuay', 'Carchi']})

In [25]:
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja
4  12212345     Cuenca      Azuay
5  12435431      Cañar     Carchi

In [26]:
result = pd.merge(data3, data5, on='cedula')

In [27]:
result

   nombres  apellidos    cedula  ciudad     Ciudad  Provincia
0     rene   elizalde  11041260    Loja  Guayaquil     Guayas
1  rolando     solano  11041261   Quito     Cuenca      Azuay
2    luisa     bermeo  12212345  Cuenca     Cuenca      Azuay
3     josé     cuenca  12435431   Cañar      Cañar     Carchi
4    rene2  elizalde2  11041263   Quito      Quito  Pichincha

In [18]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263